lgstoian/p4minishell/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.5 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_PM_ENABLE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# app_main builds the full LVGL UI (windows_init -> transcript/input/keyboard
# creation + transcript mirror printf) on the main task AND runs the DOS boot
# scripting (CONFIG.SYS / AUTOEXEC.BAT) through the recursive batch pipeline,
# which dispatches every line through shell_execute_command -> segment -> core.
# The 3584-byte default overflowed in vfprintf during shell_build_ui, and 8192
# overflowed in the same machinery once boot scripting plus the shell's
# argument-cap and echo hardening added frames on that path. 16384 gives the
# boot path comfortable headroom for nested batch files.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Wi-Fi/IP event handlers call the shell transcript (vsnprintf formatting) and
# header notify hooks directly on the esp_event `sys_evt` task. The 2304-byte
# default overflows with a stack protection fault in the vfprintf machinery
# right after esp_wifi_start(); 16384 gives the handler path real headroom and
# margin for the hosted RPC/event dispatch (esp_hosted 3.0.6).
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=16384


# ESP-Hosted on ESP32-P4 with ESP32-C6 co-processor over SDIO
CONFIG_ESP_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_HOST=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
CONFIG_ESP_HOSTED_HOST_SDIO_SLOT=1
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=10000
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ALWAYS=y
CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_ON_TIMEOUT_NONE=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_RESTART_ON_FAILURE=n
# Preserve internal RAM (shared with LVGL) by placing hosted DMA transport
# buffers in PSRAM first. The esp_hosted SDIO/scan paths have historically
# overrun internal-RAM heap metadata (W1); isolating their allocations in
# PSRAM keeps any overrun away from the LVGL timer/object lists.
CONFIG_EH_HOST_PORT_DMA_PREFER_SPIRAM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_HOST_FEAT_BT=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_USE_LABEL=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# USB host defaults required by the local usb component override.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250
CONFIG_USB_HOST_RESET_HOLD_MS=30
CONFIG_USB_HOST_RESET_RECOVERY_MS=30
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10
CONFIG_USB_HOST_RESUME_HOLD_MS=30
CONFIG_USB_HOST_RESUME_RECOVERY_MS=20
CONFIG_USB_HOST_SUSPEND_ENTRY_MS=20
CONFIG_USB_OTG_SUPPORTED=y

# Station-only Wi-Fi profile. The networking module always calls
# esp_wifi_set_mode(WIFI_MODE_STA); disabling SoftAP support here makes the
# constraint structural rather than conventional, and reclaims the AP code
# path from the image.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# esp_wifi_remote mirrors the Wi-Fi Kconfig under its own WIFI_RMT_ prefix, and
# on the hosted path that mirror is the one that matters. Both must be set.
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=n

# Image-budget constraints. These were previously only in the generated
# sdkconfig, so regenerating it silently reverted them to the ESP-IDF defaults
# and grew the image. Pinning them here makes them durable.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# PSRAM XIP instruction/rodata mapping must stay disabled: enabling it
# overflows the flash/PSRAM budget at link time on this board.
CONFIG_SPIRAM_XIP_FROM_PSRAM=n

# On RISC-V the IDF default backtrace method is "None", which hides the call
# stack on a panic. Enable unwinding so crash reports include a real
# backtrace for triage on hardware.
CONFIG_ESP_SYSTEM_USE_EH_FRAME=y

# Hold panics on screen for a few seconds instead of resetting instantly.
# The console is USB-Serial-JTAG, which drops the link during a reset; an
# instant reset would discard the backtrace before the host can read it.
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=5

# Comprehensive heap poisoning turns silent heap corruption into a loud,
# attributed abort at free time. This board has shown intermittent LVGL/UI
# faults; keep the check on so a corrupting call site is named, not guessed.
CONFIG_HEAP_POISONING_COMPREHENSIVE=y

# Treat a task-watchdog timeout as a panic (with a decoded backtrace) instead
# of a silent reset, so a wedged task is attributable to the blocked frame.
CONFIG_ESP_TASK_WDT_PANIC=y

# Disable the LVGL default theme's style-transition animations. The theme
# starts an 80 ms transition animation on every style change; widgets that are
# restyled on every refresh (header, transcript, input line, keyboard) churn
# pending transitions, and under load (e.g. Bluetooth NimBLE init) the churned
# transition descriptors corrupt the LVGL pool - an intermittent fault in the
# transition start/completed callbacks dereferencing reused memory. Style
# changes become instant. Scroll, cursor, and interaction behaviour are
# unaffected (they are separate from style transitions).
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=0

# Enable LVGL snapshot feature for the screenshot command.
# Required by the `screenshot` / `scr` / `capture` command to capture
# the current screen as a BMP image.
CONFIG_LV_USE_SNAPSHOT=y

# LVGL must use the standard C heap (CLIB malloc) instead of its built-in 64KB static pool.
# The transcript span group grows with every command; the 64KB built-in pool fills up and
# lv_malloc() returns NULL, which LV_ASSERT_MALLOC turns into an infinite loop that freezes the UI.
# With CLIB malloc, LVGL allocations use the system heap (ESP32-P4: PSRAM), so memory is effectively unbounded.
CONFIG_LV_USE_CLIB_MALLOC=y

# If an allocation ever fails, degrade gracefully (skip the span) instead of LVGL's
# LV_ASSERT_MALLOC infinite loop that freezes the UI. lv_span_set_text() already
# returns when the allocation is NULL.
# CONFIG_LV_USE_ASSERT_MALLOC is not set
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Boot-time Wi-Fi diagnostic scan is disabled by default. On earlier esp_hosted
# releases the scan path frequently corrupted heap metadata when it ran
# immediately after Wi-Fi start-up. Keep it off unless specifically debugging
# connectivity; the `wifi diag` command can still be run manually when needed.
# CONFIG_P4MINISHELL_WIFI_BOOT_DIAGNOSTIC is not set
